brew "curl"
brew "kitty"
brew "gpg"
brew "nvim"
brew "tmux"
brew "docker"
brew "colima", args: ["HEAD"]
brew "go"
brew "fzf"
brew "ripgrep"

cask "google-chrome"
cask "brave-browser"
# for window management
cask "amethyst"
# for smooth scrolling
cask "mos"
cask "alfred"
cask "intellij-idea"
