brew "curl"
brew "kitty"
brew "gpg"
brew "nvim"
brew "tmux"
brew "docker"
brew "colima", args: ["HEAD"]
brew "go"
brew "fzf"
# to jump folders
brew "zoxide"
brew "lazygit"
brew "ripgrep"
brew "jq"
brew "ripgrep"
brew "wget"
# better cat
brew "bat"
# shorter, tldr style alternative to manpages
brew "tlrc"

# tilling window manager like i3
cask "nikitabobko/tap/aerospace"
cast "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "brave-browser"
# for smooth scrolling
cask "mos"
cask "raycast"
cask "intellij-idea"
